In [1]:
import pandas as pd
import pymysql as sql
db = sql.connect(host='localhost',user='root',password='abhiyadav;',database='Abhi')
s=pd.read_sql_query('SELECT * FROM student',con=db)
k=[2,4]
s['tax']=k

s.drop(['tax'],axis=1)
s.drop([0],axis=0)
s

C:\Users\ABHISHEK YADAV\AppData\Local\Temp\ipykernel_106156\3024733994.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  s=pd.read_sql_query('SELECT * FROM student',con=db)

   id  name  tax
0   1  Abhi    2
1   2   Ram    4

In [2]:


df=pd.read_csv(r"C:\Users\ABHISHEK YADAV\Downloads\Canadian-Earthquakes-2010-2019.csv")
df['Ranking']=df['depth'].rank().astype('int')
df

,magnitude_codelist,magnitude,magnitude_type,date,place,depth,latitude,longitude,OBJECTID,longitude_geom,latitude_geom,Ranking
0,<2,1.7,ML,2010-01-01T00:16:49+0000,81 km NE of Seattle,0.0,48.192001,-121.677002,1,-121.677315,48.191706,957
1,2,2.2,MN,2010-01-01T00:52:50+0000,86 km NW from Maniwaki,18.0,47.028999,-76.583000,2,-76.583303,47.028909,31060
2,<2,1.8,MN,2010-01-01T03:21:58+0000,21 km NW from Mont-Laurier,18.0,46.651001,-75.734001,3,-75.733902,46.650809,31060
3,<2,1.5,MN,2010-01-01T04:14:51+0000,CHARLEVOIX SEISMIC ZONE,13.0,47.740002,-69.741997,4,-69.742000,47.740210,25057
4,<2,1.6,ML,2010-01-01T04:15:17+0000,83 km W of Gold R.,11.6,49.500999,-127.222000,5,-127.222216,49.500705,24183
...,...,...,...,...,...,...,...,...,...,...,...,...
44556,<2,1.8,ML,2019-12-31T18:37:24+0000,"31 km SE of Ashcroft, BC",14.0,50.487999,-121.035004,44557,-121.035415,50.487806,25744
44557,2,2.4,MN,2019-12-31T22:18:53+0000,"Blast, Laronde Mine, QC",0.0,48.250000,-78.448997,44558,-78.449004,48.250409,957
44558,2,2.0,ML,2019-12-31T23:11:07+0000,"29 km SE of Ashcroft, BC",10.5,50.526001,-121.005997,44559,-121.006115,50.526206,23579
44559,<2,1.9,MN,2019-12-31T23:53:23+0000,"6 km N from Cornwall, ON",18.0,45.083000,-74.718002,44560,-74.718302,45.083409,31060
44560,<2,1.3,MN,2019-12-31T23:54:02+0000,"CHARLEVOIX SEISMIC ZONE, QC.",3.8,47.492001,-70.412003,44561,-70.412401,47.491910,9324

In [7]:
class student:
    def __init__(self,marks):
        self.marks=marks
        
    def yadav(self):
        return print(f"{self.marks}this is the total marks of the student")

class rakesh(student):
    def nidhi(self):
        return print(f"this is the other class but the valaue are the same{self.marks}this")
# parent=student()
rakhi=rakesh(50)
rakhi.nidhi()
# parent.yadav()

this is the other class but the valaue are the same50this

In [16]:
list =[2,5,3,6,6,4]
a=list.count(6)
print(a)

2

In [18]:
my_list = [2, 5, 3, 6, 4, 3]
my_list.append(200000)
print(my_list)

[2, 5, 3, 6, 4, 3, 200000]

In [20]:
my_list = [2, 5, 3, 6, 4, 3]
my_list.extend([2,5,5,7,8,3])
my_list

[2, 5, 3, 6, 4, 3, 2, 5, 5, 7, 8, 3]

In [3]:
df=pd.read_csv(r"C:\Users\ABHISHEK YADAV\Downloads\employee_salary_dataset.csv")
# df.loc[2]=[3,'Abhishek_Yadav','IT',15,'Masters',24,'Male','Ghaziabad',28436]
# df['Ranking']=df['Monthly_Salary'].rank().astype('int') 

# df['Dens_Ranking']=df['Monthly_Salary'].rank(method='dense').astype('int') 
# df=df.sort_values(by='Ranking')

df.head(15)

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290

In [109]:
df[(df['Monthly_Salary']>=50000)&(df['Monthly_Salary']<=60000)]

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary,Ranking,Dens_Ranking
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746,12,11
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635,13,12
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828,14,13

In [122]:
df
df[df['Name'].isin(['Abhishek_Yadav','Employee_14','Employee_17','Employee_10','Employee_49'])]

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary,Ranking,Dens_Ranking
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420,1,1
2,3,Abhishek_Yadav,IT,15,Masters,24,Male,Ghaziabad,28436,2,2
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436,2,2
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895,5,4
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893,6,5

In [36]:
df
df[~df['Name'].isin(['Abhishek_Yadav','Employee_14','Employee_17','Employee_10','Employee_49'])]

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary,Ranking,Dens_Ranking
2,3,Abhishek_Yadav,IT,15,Masters,24,Male,Ghaziabad,28436,2,2

In [22]:
df
# y=df['Department'].unique()
# y
# df['Department'].value_counts()
# l=df.set_index('Department')
# l
df[df['Department'].str.startswith('I')]
#

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary,Ranking,Dens_Ranking
2,3,Abhishek_Yadav,IT,15,Masters,24,Male,Ghaziabad,28436,2,2
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600,4,3
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429,7,6
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830,11,10
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525,21,20
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714,22,21
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491,28,27
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909,37,36
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660,41,40
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983,45,44

In [7]:
# t=df['Department'].unique()
# t
df['Department'].value_counts()['IT']
# df.rename(rows={'Abhishek_Yadav':'Abhishek'})
# df['Department'].value_counts(['IT'])
# df.iloc[0:5,1:5]
# df['department_years']=df['Department']+df['Experience_Years'].astype(str)
# df
# df.iloc[16:17]
# df
# df[df['Education_Level'].str.len()3]

np.int64(10)

In [6]:
#map()
#apply()
#apply map()
df
df['persentage']=df['Monthly_Salary']/10000
df

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary,persentage
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416,11.1416
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271,9.5271
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064,6.9064
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091,9.5091
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450,13.2450
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818,6.5818
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525,7.0525
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830,4.4830
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429,4.2429
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893,3.1893
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381,14.1381
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909,10.4909
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333,7.2333
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436,2.8436
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290,9.9290
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213,10.1213
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895,3.0895
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738,4.4738
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746,5.5746
19,20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377,7.4377
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404,7.3404
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045,7.9045
22,23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888,12.2888
23,24,Employee_24,HR,15,Master,48,Male,Bangalore,64790,6.4790
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455,13.2455
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600,3.0600
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660,11.9660
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179,11.8179
28,29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764,6.5764
29,30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543,9.9543
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714,7.0714
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835,8.1835
32,33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946,12.7946
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616,13.4616
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983,13.0983
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744,9.8744
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491,8.1491
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123,14.9123
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589,4.3589
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484,6.8484
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989,10.7989
41,42,Employee_42,HR,11,PhD,23,Male,Chennai,61212,6.1212
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525,6.8525
43,44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202,7.2202
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635,5.7635
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208,8.8208
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828,5.8828
47,48,Employee_48,Operations,1,High School,40,Male,Chennai,43711,4.3711
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420,2.8420
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752,12.1752

In [64]:
h=df.groupby(['Department','Education_Level'])
h

In [65]:
for i,j in h:
    print(i)
    print(j)

('Finance', 'Bachelor')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
13          14  Employee_14    Finance                 6        Bachelor   27
39          40  Employee_40    Finance                12        Bachelor   38

    Gender    City  Monthly_Salary  persentage
13    Male   Delhi           28436      2.8436
39  Female  Mumbai           68484      6.8484
('Finance', 'High School')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
5            6   Employee_6    Finance                 3     High School   50
15          16  Employee_16    Finance                 4     High School   49

    Gender    City  Monthly_Salary  persentage
5     Male  Mumbai           65818      6.5818
15  Female   Delhi          101213     10.1213
('Finance', 'Master')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
20          21  Employee_21    Finance                 4          Master   46
27          28  Employee_28    Finance                16          Master   29
43          44  Employee_44    Finance                17          Master   44
44          45  Employee_45    Finance                 8          Master   53
46          47  Employee_47    Finance                 3          Master   22

    Gender       City  Monthly_Salary  persentage
20  Female      Delhi           73404      7.3404
27  Female  Hyderabad          118179     11.8179
43    Male  Hyderabad           72202      7.2202
44    Male      Delhi           57635      5.7635
46  Female      Delhi           58828      5.8828
('Finance', 'PhD')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
48          49  Employee_49    Finance                 5             PhD   23

    Gender       City  Monthly_Salary  persentage
48  Female  Hyderabad           28420       2.842
('HR', 'Bachelor')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
33          34  Employee_34         HR                15        Bachelor   53

    Gender   City  Monthly_Salary  persentage
33  Female  Delhi          134616     13.4616
('HR', 'High School')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
24          25  Employee_25         HR                 8     High School   34

    Gender       City  Monthly_Salary  persentage
24  Female  Bangalore          132455     13.2455
('HR', 'Master')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
23          24  Employee_24         HR                15          Master   48
38          39  Employee_39         HR                 1          Master   24

   Gender       City  Monthly_Salary  persentage
23   Male  Bangalore           64790      6.4790
38   Male     Mumbai           43589      4.3589
('HR', 'PhD')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
18          19  Employee_19         HR                 2             PhD   32
41          42  Employee_42         HR                11             PhD   23
45          46  Employee_46         HR                 3             PhD   54

    Gender       City  Monthly_Salary  persentage
18    Male    Chennai           55746      5.5746
41    Male    Chennai           61212      6.1212
45  Female  Hyderabad           88208      8.8208
('IT', 'Bachelor')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
8            9   Employee_9         IT                 4        Bachelor   53
26          27  Employee_27         IT                 8        Bachelor   27
30          31  Employee_31         IT                15        Bachelor   54

    Gender       City  Monthly_Salary  persentage
8     Male  Hyderabad           42429      4.2429
26  Female      Delhi          119660     11.9660
30  Female  Hyderabad           70714      7.0714
('IT', 'High School')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
2            3   Employee_3         IT                12     High School   51
36          37  Employee_37         IT                 7     High School   33

    Gender       City  Monthly_Salary  persentage
2   Female  Hyderabad           69064      6.9064
36    Male    Chennai           81491      8.1491
('IT', 'Master')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
11          12  Employee_12         IT                 4          Master   49
25          26  Employee_26         IT                14          Master   24
34          35  Employee_35         IT                13          Master   53

    Gender       City  Monthly_Salary  persentage
11  Female  Hyderabad          104909     10.4909
25    Male  Hyderabad           30600      3.0600
34    Male  Bangalore          130983     13.0983
('IT', 'PhD')
   EmployeeID        Name Department  Experience_Years Education_Level  Age  \
6           7  Employee_7         IT                14             PhD   57
7           8  Employee_8         IT                17             PhD   34

   Gender       City  Monthly_Salary  persentage
6    Male     Mumbai           70525      7.0525
7  Female  Bangalore           44830      4.4830
('Marketing', 'Bachelor')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
19          20  Employee_20  Marketing                10        Bachelor   49
40          41  Employee_41  Marketing                 8        Bachelor   23

    Gender       City  Monthly_Salary  persentage
19    Male  Bangalore           74377      7.4377
40  Female  Bangalore          107989     10.7989
('Marketing', 'High School')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
22          23  Employee_23  Marketing                16     High School   22
28          29  Employee_29  Marketing                13     High School   48
29          30  Employee_30  Marketing                18     High School   30
42          43  Employee_43  Marketing                19     High School   49
49          50  Employee_50  Marketing                10     High School   47

    Gender       City  Monthly_Salary  persentage
22    Male  Bangalore          122888     12.2888
28    Male  Bangalore           65764      6.5764
29    Male      Delhi           99543      9.9543
42  Female      Delhi           68525      6.8525
49  Female  Bangalore          121752     12.1752
('Marketing', 'Master')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
0            1   Employee_1  Marketing                15          Master   53
16          17  Employee_17  Marketing                18          Master   41
31          32  Employee_32  Marketing                13          Master   45
32          33  Employee_33  Marketing                 9          Master   36

    Gender       City  Monthly_Salary  persentage
0   Female      Delhi          111416     11.1416
16  Female  Hyderabad           30895      3.0895
31  Female  Hyderabad           81835      8.1835
32    Male  Bangalore          127946     12.7946
('Marketing', 'PhD')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
10          11  Employee_11  Marketing                 8             PhD   43
14          15  Employee_15  Marketing                10             PhD   49

    Gender    City  Monthly_Salary  persentage
10    Male   Delhi          141381     14.1381
14  Female  Mumbai           99290      9.9290
('Operations', 'Bachelor')
   EmployeeID        Name  Department  Experience_Years Education_Level  Age  \
1           2  Employee_2  Operations                 7        Bachelor   25

   Gender       City  Monthly_Salary  persentage
1  Female  Bangalore           95271      9.5271
('Operations', 'High School')
    EmployeeID         Name  Department  Experience_Years Education_Level  \
9           10  Employee_10  Operations                18     High School
47          48  Employee_48  Operations                 1     High School

    Age Gender     City  Monthly_Salary  persentage
9    28   Male   Mumbai           31893      3.1893
47   40   Male  Chennai           43711      4.3711
('Operations', 'Master')
    EmployeeID         Name  Department  Experience_Years Education_Level  \
4            5   Employee_5  Operations                15          Master
12          13  Employee_13  Operations                 2          Master
21          22  Employee_22  Operations                14          Master
35          36  Employee_36  Operations                 1          Master
37          38  Employee_38  Operations                 9          Master

    Age  Gender       City  Monthly_Salary  persentage
4    36  Female      Delhi          132450     13.2450
12   23  Female  Hyderabad           72333      7.2333
21   54  Female      Delhi           79045      7.9045
35   45  Female      Delhi           98744      9.8744
37   23    Male     Mumbai          149123     14.9123
('Operations', 'PhD')
    EmployeeID         Name  Department  Experience_Years Education_Level  \
3            4   Employee_4  Operations                 8             PhD
17          18  Employee_18  Operations                12             PhD

    Age  Gender     City  Monthly_Salary  persentage
3    44    Male    Delhi           95091      9.5091
17   51  Female  Chennai           44738      4.4738

In [22]:
y=h['Monthly_Salary'].sum()
y

Department
Finance        672619
HR             580616
IT             765205
Marketing     1253601
Operations     842399
Name: Monthly_Salary, dtype: int64

In [24]:
k=pd.DataFrame(y)
k

            Monthly_Salary
Department
Finance             672619
HR                  580616
IT                  765205
Marketing          1253601
Operations          842399

In [36]:
df[df.Monthly_Salary==df['Monthly_Salary'].max()]

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary,persentage
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123,14.9123

In [61]:
s=df.groupby(['Department','Education_Level'])
s
for i,j in s:
    print(i)
    print(j)

('Finance', 'Bachelor')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
13          14  Employee_14    Finance                 6        Bachelor   27
39          40  Employee_40    Finance                12        Bachelor   38

    Gender    City  Monthly_Salary  persentage
13    Male   Delhi           28436      2.8436
39  Female  Mumbai           68484      6.8484
('Finance', 'High School')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
5            6   Employee_6    Finance                 3     High School   50
15          16  Employee_16    Finance                 4     High School   49

    Gender    City  Monthly_Salary  persentage
5     Male  Mumbai           65818      6.5818
15  Female   Delhi          101213     10.1213
('Finance', 'Master')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
20          21  Employee_21    Finance                 4          Master   46
27          28  Employee_28    Finance                16          Master   29
43          44  Employee_44    Finance                17          Master   44
44          45  Employee_45    Finance                 8          Master   53
46          47  Employee_47    Finance                 3          Master   22

    Gender       City  Monthly_Salary  persentage
20  Female      Delhi           73404      7.3404
27  Female  Hyderabad          118179     11.8179
43    Male  Hyderabad           72202      7.2202
44    Male      Delhi           57635      5.7635
46  Female      Delhi           58828      5.8828
('Finance', 'PhD')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
48          49  Employee_49    Finance                 5             PhD   23

    Gender       City  Monthly_Salary  persentage
48  Female  Hyderabad           28420       2.842
('HR', 'Bachelor')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
33          34  Employee_34         HR                15        Bachelor   53

    Gender   City  Monthly_Salary  persentage
33  Female  Delhi          134616     13.4616
('HR', 'High School')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
24          25  Employee_25         HR                 8     High School   34

    Gender       City  Monthly_Salary  persentage
24  Female  Bangalore          132455     13.2455
('HR', 'Master')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
23          24  Employee_24         HR                15          Master   48
38          39  Employee_39         HR                 1          Master   24

   Gender       City  Monthly_Salary  persentage
23   Male  Bangalore           64790      6.4790
38   Male     Mumbai           43589      4.3589
('HR', 'PhD')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
18          19  Employee_19         HR                 2             PhD   32
41          42  Employee_42         HR                11             PhD   23
45          46  Employee_46         HR                 3             PhD   54

    Gender       City  Monthly_Salary  persentage
18    Male    Chennai           55746      5.5746
41    Male    Chennai           61212      6.1212
45  Female  Hyderabad           88208      8.8208
('IT', 'Bachelor')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
8            9   Employee_9         IT                 4        Bachelor   53
26          27  Employee_27         IT                 8        Bachelor   27
30          31  Employee_31         IT                15        Bachelor   54

    Gender       City  Monthly_Salary  persentage
8     Male  Hyderabad           42429      4.2429
26  Female      Delhi          119660     11.9660
30  Female  Hyderabad           70714      7.0714
('IT', 'High School')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
2            3   Employee_3         IT                12     High School   51
36          37  Employee_37         IT                 7     High School   33

    Gender       City  Monthly_Salary  persentage
2   Female  Hyderabad           69064      6.9064
36    Male    Chennai           81491      8.1491
('IT', 'Master')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
11          12  Employee_12         IT                 4          Master   49
25          26  Employee_26         IT                14          Master   24
34          35  Employee_35         IT                13          Master   53

    Gender       City  Monthly_Salary  persentage
11  Female  Hyderabad          104909     10.4909
25    Male  Hyderabad           30600      3.0600
34    Male  Bangalore          130983     13.0983
('IT', 'PhD')
   EmployeeID        Name Department  Experience_Years Education_Level  Age  \
6           7  Employee_7         IT                14             PhD   57
7           8  Employee_8         IT                17             PhD   34

   Gender       City  Monthly_Salary  persentage
6    Male     Mumbai           70525      7.0525
7  Female  Bangalore           44830      4.4830
('Marketing', 'Bachelor')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
19          20  Employee_20  Marketing                10        Bachelor   49
40          41  Employee_41  Marketing                 8        Bachelor   23

    Gender       City  Monthly_Salary  persentage
19    Male  Bangalore           74377      7.4377
40  Female  Bangalore          107989     10.7989
('Marketing', 'High School')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
22          23  Employee_23  Marketing                16     High School   22
28          29  Employee_29  Marketing                13     High School   48
29          30  Employee_30  Marketing                18     High School   30
42          43  Employee_43  Marketing                19     High School   49
49          50  Employee_50  Marketing                10     High School   47

    Gender       City  Monthly_Salary  persentage
22    Male  Bangalore          122888     12.2888
28    Male  Bangalore           65764      6.5764
29    Male      Delhi           99543      9.9543
42  Female      Delhi           68525      6.8525
49  Female  Bangalore          121752     12.1752
('Marketing', 'Master')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
0            1   Employee_1  Marketing                15          Master   53
16          17  Employee_17  Marketing                18          Master   41
31          32  Employee_32  Marketing                13          Master   45
32          33  Employee_33  Marketing                 9          Master   36

    Gender       City  Monthly_Salary  persentage
0   Female      Delhi          111416     11.1416
16  Female  Hyderabad           30895      3.0895
31  Female  Hyderabad           81835      8.1835
32    Male  Bangalore          127946     12.7946
('Marketing', 'PhD')
    EmployeeID         Name Department  Experience_Years Education_Level  Age  \
10          11  Employee_11  Marketing                 8             PhD   43
14          15  Employee_15  Marketing                10             PhD   49

    Gender    City  Monthly_Salary  persentage
10    Male   Delhi          141381     14.1381
14  Female  Mumbai           99290      9.9290
('Operations', 'Bachelor')
   EmployeeID        Name  Department  Experience_Years Education_Level  Age  \
1           2  Employee_2  Operations                 7        Bachelor   25

   Gender       City  Monthly_Salary  persentage
1  Female  Bangalore           95271      9.5271
('Operations', 'High School')
    EmployeeID         Name  Department  Experience_Years Education_Level  \
9           10  Employee_10  Operations                18     High School
47          48  Employee_48  Operations                 1     High School

    Age Gender     City  Monthly_Salary  persentage
9    28   Male   Mumbai           31893      3.1893
47   40   Male  Chennai           43711      4.3711
('Operations', 'Master')
    EmployeeID         Name  Department  Experience_Years Education_Level  \
4            5   Employee_5  Operations                15          Master
12          13  Employee_13  Operations                 2          Master
21          22  Employee_22  Operations                14          Master
35          36  Employee_36  Operations                 1          Master
37          38  Employee_38  Operations                 9          Master

    Age  Gender       City  Monthly_Salary  persentage
4    36  Female      Delhi          132450     13.2450
12   23  Female  Hyderabad           72333      7.2333
21   54  Female      Delhi           79045      7.9045
35   45  Female      Delhi           98744      9.8744
37   23    Male     Mumbai          149123     14.9123
('Operations', 'PhD')
    EmployeeID         Name  Department  Experience_Years Education_Level  \
3            4   Employee_4  Operations                 8             PhD
17          18  Employee_18  Operations                12             PhD

    Age  Gender     City  Monthly_Salary  persentage
3    44    Male    Delhi           95091      9.5091
17   51  Female  Chennai           44738      4.4738

In [5]:
df[
    (df['Department'] == 'IT') &
    (df['Education_Level'] == 'Bachelor')
]

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714

In [4]:
# s=df['Monthly_Salary']
# s2=list(s)x
# h